package ex_241018_ch1.homework;

public class Lsy1205 {

	public static void main(String[] args) {
		// 주의사항, 
		// 작업 전에, 풀 해서 업데이트 확인.!!!!!!
		// 작업 시작, 커밋 -> 푸쉬
		// 현재 작업, 1) 본인 꺼(포크한 강사꺼, 본인 연습용), 2)강사 깃
		
		// 본인 깃 허브 사이트에서 -> 버튼(Sync fork, 업데이트하고), 이클립스 -> 깃 -> 풀
		
		// 관상용(뷰어용), 숙제 제출용(요구사항 작성 후).  커밋 -> 푸쉬 -> PR
		// PR -> 깃허브 사이트에서 -> contribute 에서 클릭 -> 제목 , 내용 작성 -> 요청. 
		// 주의사항, 업데이트를 안하거나, 또는 저랑 코드가 다르거나(중복), 충돌. 
		// 충돌 -> 100% 본인이 다른 파일에서 변경사항이 있다는 말. 
		// 제꺼 포크 하면, 작업은 기본은 안함. 
		// 과제를 제출시에 , 요구한 사항에 맞게 작성. -> 중복 발생 안함. 
		// 깃은 모토 -> 합집합. -> 서로가 중복이 없으면, -> 합친다. 
		// 예시)
		// test 폴더 > 1.txt 파일
		// test 폴더 > 2.txt 파일
		// 합치기 merge 성공
		
		// 예시2)
		// test 폴더 > 1.txt 파일,
		// test 폴더 > 1.txt 파일, 
		// 합치기 merge -> 충돌O
		
		// 예시3)
		// test 폴더 > 1.txt 파일 > 내용 , 1번줄 123
		// test 폴더 > 1.txt 파일 > 내용 , 2번줄 456
		// 합치기 merge -> 충돌O
		
		// 협업이 아니라, 1) 수업용 코드 공유, 2) 과제 제출(작업 한 파일만 제출.!!)
		
		System.out.println("깃테스트2, pr 보내세요. ");

	}

}
